[{"title": "Topic modeling for evaluating students' reflective writing: a case study of pre-service teachers' journals", "pages": "1-5", "doi": "10.1145/2883851.2883951", "abstract": "Journal writing is an important and common reflective practice in education. Students' reflection journals also offer a rich source of data for formative assessment. However, the analysis of the textual reflections in class of large size presents challenges. Automatic analysis of students' reflective writing holds great promise for providing adaptive real time support for students. This paper proposes a method based on topic modeling techniques for the task of themes exploration and reflection grade prediction. We evaluated this method on a sample of journal writings from pre-service teachers. The topic modeling method was able to discover the important themes and patterns emerged in students' reflection journals. Weekly topic relevance and word count were identified as important indicators of their journal grades. Based on the patterns discovered by topic modeling, prediction models were developed to automate the assessing and grading of reflection journals. The findings indicate the potential of topic modeling in serving as an analytic tool for teachers to explore and assess students' reflective thoughts in written journals.", "authors": ["Ye Chen", "Bei Yu", "Xuewei Zhang", "Yihan Yu"], "session": "SESSION: Discourse analytics"}, {"title": "Combining click-stream data with NLP tools to better understand MOOC completion", "pages": "6-14", "doi": "10.1145/2883851.2883931", "abstract": "Completion rates for massive open online classes (MOOCs) are notoriously low. Identifying student patterns related to course completion may help to develop interventions that can improve retention and learning outcomes in MOOCs. Previous research predicting MOOC completion has focused on click-stream data, student demographics, and natural language processing (NLP) analyses. However, most of these analyses have not taken full advantage of the multiple types of data available. This study combines click-stream data and NLP approaches to examine if students' on-line activity and the language they produce in the online discussion forum is predictive of successful class completion. We study this analysis in the context of a subsample of 320 students who completed at least one graded assignment and produced at least 50 words in discussion forums, in a MOOC on educational data mining. The findings indicate that a mix of click-stream data and NLP indices can predict with substantial accuracy (78%) whether students complete the MOOC. This predictive power suggests that student interaction data and language data within a MOOC can help us both to understand student retention in MOOCs and to develop automated signals of student success.", "authors": ["Scott Crossley", "Luc Paquette", "Mihai Dascalu", "Danielle S. McNamara", "Ryan S. Baker"], "session": "SESSION: Discourse analytics"}, {"title": "Towards automated content analysis of discussion transcripts: a cognitive presence case", "pages": "15-24", "doi": "10.1145/2883851.2883950", "abstract": "In this paper, we present the results of an exploratory study that examined the problem of automating content analysis of student online discussion transcripts. We looked at the problem of coding discussion transcripts for the levels of cognitive presence, one of the three main constructs in the Community of Inquiry (CoI) model of distance education. Using Coh-Metrix and LIWC features, together with a set of custom features developed to capture discussion context, we developed a random forest classification system that achieved 70.3% classification accuracy and 0.63 Cohen's kappa, which is significantly higher than values reported in the previous studies. Besides improvement in classification accuracy, the developed system is also less sensitive to overfitting as it uses only 205 classification features, which is around 100 times less features than in similar systems based on bag-of-words features. We also provide an overview of the classification features most indicative of the different phases of cognitive presence that gives an additional insights into the nature of cognitive presence learning cycle. Overall, our results show great potential of the proposed approach, with an added benefit of providing further characterization of the cognitive presence coding scheme.", "authors": ["Vitomir Kovanović", "Srećko Joksimović", "Zak Waters", "Dragan Gašević", "Kirsty Kitto", "Marek Hatala", "George Siemens"], "session": "SESSION: Discourse analytics"}, {"title": "Towards personalizing an e-quiz bank for primary school students: an exploration with association rule mining and clustering", "pages": "25-29", "doi": "10.1145/2883851.2883959", "abstract": "Given the importance of reading proficiency and habits for young students, an online e-quiz bank, Reading Battle, was launched in 2014 to facilitate reading improvement for primary-school students. With more than ten thousand questions in both English and Chinese, the system has attracted nearly five thousand learners who have made about half a million question answering records. In an effort towards delivering personalized learning experience to the learners, this study aims to discover potentially useful knowledge from learners' reading and question answering records in the Reading Battle system, by applying association rule mining and clustering analysis. The results show that learners could be grouped into three clusters based on their self-reported reading habits. The rules mined from different learner clusters can be used to develop personalized recommendations to the learners. Implications of the results on evaluating and further improving the Reading Battle system are also discussed.", "authors": ["Xiao Hu", "Yinfei Zhang", "Samuel K. W. Chu", "Xiaobo Ke"], "session": "SESSION: Learner models"}, {"title": "Introduction of learning visualisations and metacognitive support in a persuadable open learner model", "pages": "30-39", "doi": "10.1145/2883851.2883853", "abstract": "This paper describes open learner models as visualisations of learning for learners, with a particular focus on how information about their learning can be used to help them reflect on their skills, identify gaps in their skills, and plan their future learning. We offer an approach that, in addition to providing visualisations of their learning, allows learners to propose changes to their learner model. This aims to help improve the accuracy of the learner model by taking into account student viewpoints on their learning, while also promoting learner reflection on their learning as part of a discussion of the content of their learner model. This aligns well with recent calls for learning analytics for learners. Building on previous research showing that learners will use open learner models, we here investigate their initial reactions to open learner model features to identify the likelihood of uptake in contexts where an open learner model is offered on an optional basis. We focus on university students' perceptions of a range of visualisations and their stated preferences for a facility to view evidence for the learner model data and to propose changes to the values.", "authors": ["Susan Bull", "Blandine Ginon", "Clelia Boscolo", "Matthew Johnson"], "session": "SESSION: Learner models"}, {"title": "Impact of data collection on interpretation and evaluation of student models", "pages": "40-47", "doi": "10.1145/2883851.2883868", "abstract": "Student modeling techniques are evaluated mostly using historical data. Researchers typically do not pay attention to details of the origin of the used data sets. However, the way data are collected can have important impact on evaluation and interpretation of student models. We discuss in detail two ways how data collection in educational systems can influence results: mastery attrition bias and adaptive choice of items. We systematically discuss previous work related to these biases and illustrate the main points using both simulated and real data. We summarize specific consequences for practice -- not just for doing evaluation of student models, but also for data collection and publication of data sets.", "authors": ["Radek Pelánek", "Jirí Rihák", "Jan Papoušek"], "session": "SESSION: Learner models"}, {"title": "Semantic visual analytics for today's programming courses", "pages": "48-53", "doi": "10.1145/2883851.2883915", "abstract": "We designed and studied an innovative semantic visual learning analytics for orchestrating today's programming classes. The visual analytics integrates sources of learning activities by their content semantics. It automatically processs paper-based exams by associating sets of concepts to the exam questions. Results indicated the automatic concept extraction from exams were promising and could be a potential technological solution to address a real world issue. We also discovered that indexing effectiveness was especially prevalent for complex content by covering more comprehensive semantics. Subjective evaluation revealed that the dynamic concept indexing provided teachers with immediate feedback on producing more balanced exams.", "authors": ["I-Han Hsiao", "Sesha Kumar Pandhalkudi Govindarajan", "Yi-Ling Lin"], "session": "SESSION: Analytic visualizations and dashboards"}, {"title": "The role of achievement goal orientations when studying effect of learning analytics visualizations", "pages": "54-63", "doi": "10.1145/2883851.2883904", "abstract": "When designing learning analytics tools for use by learners we have an opportunity to provide tools that consider a particular learner's situation and the learner herself. To afford actual impact on learning, such tools have to be informed by theories of education. Particularly, educational research shows that individual differences play a significant role in explaining students' learning process. However, limited empirical research in learning analytics has investigated the role of theoretical constructs, such as motivational factors, that are underlying the observed differences between individuals. In this work, we conducted a field experiment to examine the effect of three designed learning analytics visualizations on students' participation in online discussions in authentic course settings. Using hierarchical linear mixed models, our results revealed that effects of visualizations on the quantity and quality of messages posted by students with differences in achievement goal orientations could either be positive or negative. Our findings highlight the methodological importance of considering individual differences and pose important implications for future design and research of learning analytics visualizations.", "authors": ["Sanam Shirazi Beheshitha", "Marek Hatala", "Dragan Gašević", "Srećko Joksimović"], "session": "SESSION: Analytic visualizations and dashboards"}, {"title": "Investigating collaborative learning success with physiological coupling indices based on electrodermal activity", "pages": "64-73", "doi": "10.1145/2883851.2883897", "abstract": "Collaborative learning is considered a critical 21st century skill. Much is known about its contribution to learning, but still investigating a process of collaboration remains a challenge. This paper approaches the investigation on collaborative learning from a psychophysiological perspective. An experiment was set up to explore whether biosensors can play a role in analysing collaborative learning. On the one hand, we identified five physiological coupling indices (PCIs) found in the literature: 1) Signal Matching (SM), 2) Instantaneous Derivative Matching (IDM), 3) Directional Agreement (DA), 4) Pearson's correlation coefficient (PCC) and the 5) Fisher's z-transform (FZT) of the PCC. On the other hand, three collaborative learning measurements were used: 1) collaborative will (CW), 2) collaborative learning product (CLP) and 3) dual learning gain (DLG). Regression analyses showed that out of the five PCIs, IDM related the most to CW and was the best predictor of the CLP. Meanwhile, DA predicted DLG the best. These results play a role in determining informative collaboration measures for designing a learning analytics, biofeedback dashboard.", "authors": ["Héctor J. Pijeira-Díaz", "Hendrik Drachsler", "Sanna Järvelä", "Paul A. Kirschner"], "session": "SESSION: Collaborative learning"}, {"title": "A pedagogical framework for learning analytics in collaborative inquiry tasks: an example from a teamwork competency awareness program", "pages": "74-83", "doi": "10.1145/2883851.2883914", "abstract": "Many pedagogical models in the field of learning analytics are implicit and do not overtly direct learner behavior. While this allows flexibility of use, this could also result in misaligned practice, and there are calls for more explicit pedagogical models in learning analytics. This paper presents an explicit pedagogical model, the Team and Self Diagnostic Learning (TSDL) framework, in the context of collaborative inquiry tasks. Key informing theories include experiential learning, collaborative learning, and the learning analytics process model. The framework was trialed through a teamwork competency awareness program for 14 year old students. A total of 272 students participated in the program. This paper foregrounds students' and teachers' evaluative accounts of the program. Findings reveal positive perceptions of the stages of the TSDL framework, despite identified challenges, which points to its potential usefulness for teaching and learning. The TSDL framework aims to provide theoretical clarity of the learning process, and foster alignment between learning analytics and the learning design. The current work provides trial outcomes of a teamwork competency awareness program that used dispositional analytics, and further efforts are underway to develop the discourse layer of the analytic engine. Future work will also be dedicated to application and refinement of the framework for other contexts and participants, both learners and teachers alike.", "authors": ["Elizabeth Koh", "Antonette Shibani", "Jennifer Pei-Ling Tan", "Helen Hong"], "session": "SESSION: Collaborative learning"}, {"title": "An analysis framework for collaborative problem solving in practice-based learning activities: a mixed-method approach", "pages": "84-88", "doi": "10.1145/2883851.2883900", "abstract": "Systematic investigation of the collaborative problem solving process in open-ended, hands-on, physical computing design tasks requires a framework that highlights the main process features, stages and actions that then can be used to provide 'meaningful' learning analytics data. This paper presents an analysis framework that can be used to identify crucial aspects of the collaborative problem solving process in practice-based learning activities. We deployed a mixed-methods approach that allowed us to generate an analysis framework that is theoretically robust, and generalizable. Additionally, the framework is grounded in data and hence applicable to real-life learning contexts. This paper presents how our framework was developed and how it can be used to analyse data. We argue for the value of effective analysis frameworks in the generation and presentation of learning analytics for practice-based learning activities.", "authors": ["Mutlu Cukurova", "Katerina Avramides", "Daniel Spikol", "Rose Luckin", "Manolis Mavrikis"], "session": "SESSION: Collaborative learning"}, {"title": "Privacy and analytics: it's a DELICATE issue a checklist for trusted learning analytics", "pages": "89-98", "doi": "10.1145/2883851.2883893", "abstract": "The widespread adoption of Learning Analytics (LA) and Educational Data Mining (EDM) has somewhat stagnated recently, and in some prominent cases even been reversed following concerns by governments, stakeholders and civil rights groups about privacy and ethics applied to the handling of personal data. In this ongoing discussion, fears and realities are often indistinguishably mixed up, leading to an atmosphere of uncertainty among potential beneficiaries of Learning Analytics, as well as hesitations among institutional managers who aim to innovate their institution's learning support by implementing data and analytics with a view on improving student success. In this paper, we try to get to the heart of the matter, by analysing the most common views and the propositions made by the LA community to solve them. We conclude the paper with an eight-point checklist named DELICATE that can be applied by researchers, policy makers and institutional managers to facilitate a trusted implementation of Learning Analytics.", "authors": ["Hendrik Drachsler", "Wolfgang Greller"], "session": "SESSION: LA challenges, accessibility and ethics"}, {"title": "What can analytics contribute to accessibility in e-learning systems and to disabled students' learning?", "pages": "99-103", "doi": "10.1145/2883851.2883946", "abstract": "This paper explores the potential of analytics for improving accessibility of e-learning and supporting disabled learners in their studies. A comparative analysis of completion rates of disabled and non-disabled students in a large five-year dataset is presented and a wide variation in comparative retention rates is characterized. Learning analytics enable us to identify and understand such discrepancies and, in future, could be used to focus interventions to improve retention of disabled students. An agenda for onward research, focused on Critical Learning Paths, is outlined. This paper is intended to stimulate a wider interest in the potential benefits of learning analytics for institutions as they try to assure the accessibility of their e-learning and provision of support for disabled students.", "authors": ["Martyn Cooper", "Rebecca Ferguson", "Annika Wolff"], "session": "SESSION: LA challenges, accessibility and ethics"}, {"title": "Affecting off-task behaviour: how affect-aware feedback can improve student learning", "pages": "104-113", "doi": "10.1145/2883851.2883936", "abstract": "This paper describes the development and evaluation of an affect-aware intelligent support component that is part of a learning environment known as iTalk2Learn. The intelligent support component is able to tailor feedback according to a student's affective state, which is deduced both from speech and interaction. The affect prediction is used to determine which type of feedback is provided and how that feedback is presented (interruptive or non-interruptive). The system includes two Bayesian networks that were trained with data gathered in a series of ecologically-valid Wizard-of-Oz studies, where the effect of the type of feedback and the presentation of feedback on students' affective states was investigated. This paper reports results from an experiment that compared a version that provided affect-aware feedback (affect condition) with one that provided feedback based on performance only (non-affect condition). Results show that students who were in the affect condition were less bored and less off-task, with the latter being statically significant. Importantly, students in both conditions made learning gains that were statistically significant, while students in the affect condition had higher learning gains than those in the non-affect condition, although this result was not statistically significant in this study's sample. Taken all together, the results point to the potential and positive impact of affect-aware intelligent support.", "authors": ["Beate Grawemeyer", "Manolis Mavrikis", "Wayne Holmes", "Sergio Gutierrez-Santos", "Michael Wiedmann", "Nikol Rummel"], "session": "SESSION: Determination of off-task/on-task behaviours"}, {"title": "Investigating boredom and engagement during writing using multiple sources of information: the essay, the writer, and keystrokes", "pages": "114-123", "doi": "10.1145/2883851.2883939", "abstract": "Writing training systems have been developed to provide students with instruction and deliberate practice on their writing. Although generally successful in providing accurate scores, a common criticism of these systems is their lack of personalization and adaptive instruction. In particular, these systems tend to place the strongest emphasis on delivering accurate scores, and therefore, tend to overlook additional indices that may contribute to students' success, such as their affective states during writing practice. This study takes an initial step toward addressing this gap by building a predictive model of students' affect using information that can potentially be collected by computer systems. We used individual difference measures, text indices, and keystroke analyses to predict engagement and boredom in 132 writing sessions. The results suggest that these three categories of indices were successful in modeling students' affective states during writing. Taken together, indices related to students' academic abilities, text properties, and keystroke logs were able classify high and low engagement and boredom in writing sessions with accuracies between 76.5% and 77.3%. These results suggest that information readily available in writing training systems can inform affect detectors and ultimately improve student models within intelligent tutoring systems.", "authors": ["Laura K. Allen", "Caitlin Mills", "Matthew E. Jacovina", "Scott Crossley", "Sidney D'Mello", "Danielle S. McNamara"], "session": "SESSION: Determination of off-task/on-task behaviours"}, {"title": "Interactive surfaces and learning analytics: data, orchestration aspects, pedagogical uses and challenges", "pages": "124-133", "doi": "10.1145/2883851.2883873", "abstract": "The proliferation of varied types of multi-user interactive surfaces (such as digital whiteboards, tabletops and tangible interfaces) is opening a new range of applications in face-to-face (f2f) contexts. They offer unique opportunities for Learning Analytics (LA) by facilitating multi-user sensemaking of automatically captured digital footprints of students' f2f interactions. This paper presents an analysis of current research exploring learning analytics associated with the use of surface devices. We use a framework to analyse our first-hand experiences, and the small number of related deployments according to four dimensions: the orchestration aspects involved; the phases of the pedagogical practice that are supported; the target actors; and the levels of iteration of the LA process. The contribution of the paper is twofold: 1) a synthesis of conclusions that identify the degree of maturity, challenges and pedagogical opportunities of the existing applications of learning analytics and interactive surfaces; and 2) an analysis framework that can be used to characterise the design space of similar areas and LA applications.", "authors": ["Roberto Martinez-Maldonado", "Bertrand Schneider", "Sven Charleer", "Simon Buckingham Shum", "Joris Klerkx", "Erik Duval"], "session": "SESSION: Learning tools and interventions"}, {"title": "Evaluation of an adaptive practice system for learning geography facts", "pages": "134-142", "doi": "10.1145/2883851.2883884", "abstract": "Computerized educational systems are increasingly provided as open online services which provide adaptive personalized learning experience. To fully exploit potential of such systems, it is necessary to thoroughly evaluate different design choices. However, both openness and adaptivity make proper evaluation difficult. We provide a detailed report on evaluation of an online system for adaptive practice of geography, and use this case study to highlight methodological issues with evaluation of open online learning systems, particularly attrition bias. To facilitate evaluation of learning, we propose to use randomized reference questions. We illustrate application of survival analysis and learning curves for declarative knowledge. The result provide an interesting insight into the impact of adaptivity on learner behaviour and learning.", "authors": ["Jan Papoušek", "Vít Stanislav", "Radek Pelánek"], "session": "SESSION: Learning tools and interventions"}, {"title": "Towards analytics for educational interactive e-books: the case of the reflective designer analytics platform (RDAP)", "pages": "143-147", "doi": "10.1145/2883851.2883943", "abstract": "This paper presents an analytics dashboard that has been developed for designers of interactive e-books. This is part of the EU-funded MC Squared project that is developing a platform for authoring interactive educational e-books. The primary objective is to develop technologies and resources that enhance creative thinking for both designers (authors) and learners. The learning material is expected to offer learners opportunities to engage creatively with mathematical problems and develop creative mathematical thinking. The analytics dashboard is designed to increase authors' awareness so that they can make informed decisions on how to redesign and improve the e-books. This paper presents architectural and design decisions on key features of the dashboard and discusses future steps with respect to the potential for exploratory data analysis.", "authors": ["Sokratis Karkalas", "Manolis Mavrikis", "Oliver Labs"], "session": "SESSION: Learning tools and interventions"}, {"title": "Teaching analytics: towards automatic extraction of orchestration graphs using wearable sensors", "pages": "148-157", "doi": "10.1145/2883851.2883927", "abstract": "'Teaching analytics' is the application of learning analytics techniques to understand teaching and learning processes, and eventually enable supportive interventions. However, in the case of (often, half-improvised) teaching in face-to-face classrooms, such interventions would require first an understanding of what the teacher actually did, as the starting point for teacher reflection and inquiry. Currently, such teacher enactment characterization requires costly manual coding by researchers. This paper presents a case study exploring the potential of machine learning techniques to automatically extract teaching actions during classroom enactment, from five data sources collected using wearable sensors (eye-tracking, EEG, accelerometer, audio and video). Our results highlight the feasibility of this approach, with high levels of accuracy in determining the social plane of interaction (90%, κ=0.8). The reliable detection of concrete teaching activity (e.g., explanation vs. questioning) accurately still remains challenging (67%, κ=0.56), a fact that will prompt further research on multimodal features and models for teaching activity extraction, as well as the collection of a larger multimodal dataset to improve the accuracy and generalizability of these methods.", "authors": ["Luis P. Prieto", "Kshitij Sharma", "Pierre Dillenbourg", "María Jesús"], "session": "SESSION: Teaching and teacher analytics"}, {"title": "Student perspectives on data provision and use: starting to unpack disciplinary differences", "pages": "158-167", "doi": "10.1145/2883851.2883945", "abstract": "How can we best align learning analytics practices with disciplinary knowledge practices in order to support student learning? Although learning analytics itself is an interdisciplinary field, it tends to take a 'one-size-fits-all' approach to the collection, measurement, and reporting of data, overlooking disciplinary knowledge practices. In line with a recent trend in higher education research, this paper considers the contribution of a realist sociology of education to the field of learning analytics, drawing on findings from recent student focus groups at an Australian university. It examines what learners say about their data needs with reference to organizing principles underlying knowledge practices within their disciplines. The key contribution of this paper is a framework that could be used as the basis for aligning the provision and/or use of data in relation to curriculum, pedagogy, and assessment with disciplinary knowledge practices. The framework extends recent research in Legitimation Code Theory, which understands disciplinary differences in terms of the principles that underpin knowledge-building. The preliminary analysis presented here both provides a tool for ensuring a fit between learning analytics practices and disciplinary practices and standards for achievement, and signals disciplinarity as an important consideration in learning analytics practices.", "authors": ["Jen McPherson", "Huong Ly Tong", "Scott J. Fatt", "Danny Y. T. Liu"], "session": "SESSION: Teaching and teacher analytics"}, {"title": "Design and evaluation of teacher assistance tools for exploratory learning environments", "pages": "168-172", "doi": "10.1145/2883851.2883909", "abstract": "We present our approach to designing and evaluating tools that can assist teachers in classroom settings where students are using Exploratory Learning Environments (ELEs), using as our case study the MiGen system, which targets 1114 year old students' learning of algebra. We discuss the challenging role of teachers in exploratory learning settings and motivate the need for visualisation and notification tools that can assist teachers in focusing their attention across the whole class and inform their interventions. We present the design and evaluation approach followed during the development of MiGen's Teacher Assistance tools, drawing parallels with the recently proposed LATUX workflow but also discussing how we go beyond this to include a large number of teacher participants in our evaluation activities, so as to gain the benefit of different view points. We discuss the results of the evaluations, which show that participants appreciated the capabilities of the tools and were mostly able to use them quickly and accurately.", "authors": ["Manolis Mavrikis", "Sergio Gutierrez-Santos", "Alex Poulovassilis"], "session": "SESSION: Teaching and teacher analytics"}, {"title": "The learning analytics readiness instrument", "pages": "173-182", "doi": "10.1145/2883851.2883925", "abstract": "Little is known about the processes institutions use when discerning their readiness to implement learning analytics. This study aims to address this gap in the literature by using survey data from the beta version of the Learning Analytics Readiness Instrument (LARI) [1]. Twenty-four institutions were surveyed and 560 respondents participated. Five distinct factors were identified from a factor analysis of the results: Culture; Data Management Expertise; Data Analysis Expertise; Communication and Policy Application; and, Training. Data were analyzed using both the role of those completing the survey and the Carnegie classification of the institutions as lenses. Generally, information technology professionals and institutions classified as Research Universities--Very High research activity had significantly different scores on the identified factors. Working within a framework of organizational learning, this paper details the concept of readiness as a reflective process, as well as how the implementation and application of analytics should be done so with ethical considerations in mind. Limitations of the study, as well as next steps for research in this area, are also discussed.", "authors": ["Meghan Oster", "Steven Lonn", "Matthew D. Pistilli", "Michael G. Brown"], "session": "SESSION: Institutional perspectives and challenges"}, {"title": "Real-time indicators and targeted supports: using online platform data to accelerate student learning", "pages": "183-187", "doi": "10.1145/2883851.2883942", "abstract": "Statway® is one of the Community College Pathways initiatives designed to promote students' success in their developmental math sequence and reduce the time required to earn college credit. A recent causal analysis confirmed that Statway dramatically increased students' success rates in half the time across two different cohorts. These impressive results were also obtained across gender and race/ethnicity groups. However, there is still room for improvement. Students who did not succeed in Statway often did not complete the first of the two-course sequence. Therefore, the objective of this study is to formulate a series of indicators from self-report and online learning system data, alerting instructors to students' progress during the first weeks of the first course in the Statway sequence.", "authors": ["Ouajdi Manai", "Hiroyuki Yamada", "Christopher Thorn"], "session": "SESSION: Institutional perspectives and challenges"}, {"title": "Bringing order to chaos in MOOC discussion forums with content-related thread identification", "pages": "188-197", "doi": "10.1145/2883851.2883916", "abstract": "This study addresses the issues of overload and chaos in MOOC discussion forums by developing a model to categorize and identify threads based on whether or not they are substantially related to the course content. Content-related posts were defined as those that give/seek help for the learning of course material and share/comment on relevant resources. A linguistic model was built based on manually-coded starting posts in threads from a statistics MOOC (n=837) and tested on thread starting posts from the second offering of the same course (n=304) and a different statistics course (n=298). The number of views and votes threads received were tested to see if they helped classification. Results showed that content-related posts in the statistics MOOC had distinct linguistic features which appeared to be unrelated to the subject-matter domain; the linguistic model demonstrated good cross-course reliability (all recall and precision > .77) and was useful across all time segments of the courses; number of views and votes were not helpful for classification.", "authors": ["Alyssa Friend Wise", "Yi Cui", "Jovita Vytasek"], "session": "SESSION: MOOC discussion analysis"}, {"title": "Investigating social and semantic user roles in MOOC discussion forums", "pages": "198-207", "doi": "10.1145/2883851.2883924", "abstract": "This paper describes the analysis of the social and semantic structure of discussion forums in massive open online courses (MOOCs) in terms of information exchange and user roles. To that end, we analyse a network of forum users based on information-giving relations extracted from the forum data. Connection patterns that appear in the information exchange network of forum users are used to define specific user roles in a social context. Semantic roles are derived by identifying thematic areas in which an actor seeks for information (problem areas) and the areas of interest in which an actor provides information to others (expertise). The interplay of social and semantic roles is analysed using a socio-semantic blockmodelling approach. The results show that social and semantic roles are not strongly interdependent. This indicates that communication patterns and interests of users develop simultaneously only to a moderate extent. In addition to the case study, the methodological contribution is in combining traditional blockmodelling with semantic information to characterise participant roles.", "authors": ["Tobias Hecking", "Irene-Angelica Chounta", "H. Ulrich Hoppe"], "session": "SESSION: MOOC discussion analysis"}, {"title": "Untangling MOOC learner networks", "pages": "208-212", "doi": "10.1145/2883851.2883919", "abstract": "Research in formal education has repeatedly offered evidence of the importance of social interactions for student learning. However, it remains unclear whether the development of such interpersonal relationships has the same influence on learning in the context of large-scale open online learning. For instance, in MOOCs group members frequently change and the volume of interactions can quickly amass to chaos, therefore impeding an individual's propensity to foster meaningful relationships. This paper examined a MOOC for its potential to develop social processes. As it is exceedingly difficult to establish a relationship with somebody who seldom accesses a MOOC discussion, we singled out a cohort defined by its participants' regularity of forum presence. The study, analysed this 'cohort' and its development, in comparison to the entire MOOC learner network. Mixed methods of social network analysis (SNA), content analysis and statistical network modelling, revealed the potential for unfolding social processes among a more persistent group of learners in the MOOC setting.", "authors": ["Poquet Oleksandra", "Dawson Shane"], "session": "SESSION: MOOC discussion analysis"}, {"title": "Reflecting on reflective writing analytics: assessment challenges and iterative evaluation of a prototype tool", "pages": "213-222", "doi": "10.1145/2883851.2883955", "abstract": "When used effectively, reflective writing tasks can deepen learners' understanding of key concepts, help them critically appraise their developing professional identity, and build qualities for lifelong learning. As such, reflecting writing is attracting substantial interest from universities concerned with experiential learning, reflective practice, and developing a holistic conception of the learner. However, reflective writing is for many students a novel genre to compose in, and tutors may be inexperienced in its assessment. While these conditions set a challenging context for automated solutions, natural language processing may also help address the challenge of providing real time, formative feedback on draft writing. This paper reports progress in designing a writing analytics application, detailing the methodology by which informally expressed rubrics are modelled as formal rhetorical patterns, a capability delivered by a novel web application. This has been through iterative evaluation on an independently human-annotated corpus, showing improvements from the first to second version. We conclude by discussing the reasons why classifying reflective writing has proven complex, and reflect on the design processes enabling work across disciplinary boundaries to develop the prototype to its current state.", "authors": ["Simon Buckingham Shum", "Ágnes Sándor", "Rosalie Goldsmith", "Xiaolong Wang", "Randall Bass", "Mindy McWilliams"], "session": "SESSION: Language, writing, and interaction"}, {"title": "Longitudinal engagement, performance, and social connectivity: a MOOC case study using exponential random graph models", "pages": "223-230", "doi": "10.1145/2883851.2883934", "abstract": "This paper explores a longitudinal approach to combining engagement, performance and social connectivity data from a MOOC using the framework of exponential random graph models (ERGMs). The idea is to model the social network in the discussion forum in a given week not only using performance (assignment scores) and overall engagement (lecture and discussion views) covariates within that week, but also on the same person-level covariates from adjacent previous and subsequent weeks. We find that over all eight weekly sessions, the social networks constructed from the forum interactions are relatively sparse and lack the tendency for preferential attachment. By analyzing data from the second week, we also find that individuals with higher performance scores from current, previous, and future weeks tend to be more connected in the social network. Engagement with lectures had significant but sometimes puzzling effects on social connectivity. However, the relationships between social connectivity, performance, and engagement weakened over time, and results were not stable across weeks.", "authors": ["Mengxiao Zhu", "Yoav Bergner", "Yan Zhang", "Ryan Baker", "Yuan Wang", "Luc Paquette"], "session": "SESSION: Language, writing, and interaction"}, {"title": "English language learner experiences of formal and informal learning environments", "pages": "231-235", "doi": "10.1145/2883851.2883896", "abstract": "Many people who do not know English have moved to English-speaking countries to learn English. Once there, they learn English through formal and informal methods. While considerable work has studied the experiences of English language learners in different learning environments, we have yet to see analytics that detail the experiences of this population within formal and informal learning environments. This study used the experience sampling methodology to capture the information that is needed to detail the communication and affective experiences of advanced English language learners. The collected data reveals differences in how English language learners perceived their communication success based on their learning context, with higher levels of communicative success experienced in formal learning settings. No such differences were found for learners', highly negative, affect. The data suggest a need for additional emotional support within formal and informal learning environments as well as a need for oral communication support within informal contexts.", "authors": ["Carrie Demmans Epp"], "session": "SESSION: Language, writing, and interaction"}, {"title": "Analysing engagement in an online management programme and implications for course design", "pages": "236-240", "doi": "10.1145/2883851.2883894", "abstract": "We analyse engagement and performance data arising from participants' interactions with an in-house LMS at Imperial College London while a cohort of students follow two courses on a new online postgraduate degree in Management. We identify and investigate two main questions relating to the relationships between engagement and performance, drawing recommendations for improved guidelines to inform the design of such courses.", "authors": ["Marc Wells", "Alex Wollenschlaeger", "David Lefevre", "George D. Magoulas", "Alexandra Poulovassilis"], "session": "SESSION: Institutional perspectives"}, {"title": "Measuring financial implications of an early alert system", "pages": "241-248", "doi": "10.1145/2883851.2883923", "abstract": "The prevalence of early alert systems (EAS) at tertiary institutions is increasing. These systems are designed to assist with targeted student support in order to improve student retention. They also require considerable human and capital resources to implement, with significant costs involved. It is therefore an imperative that the systems can demonstrate quantifiable financial benefits to the institution. The purpose of this paper is to report on the financial implications of implementing an EAS at an Australian university as a case study. The case study institution implemented an EAS in 2011 using data generated from a data warehouse. The data set is comprised of 16,124 students enrolled between 2011 and 2013. Using a treatment effects approach, the study found that the cost of a student discontinuing was on average $4,687. Students identified by the EAS remained enrolled for longer, with the institution benefiting with approximately an additional $4,004 in revenue per student over the length of enrolment. All schools had a significant positive effect associated with the EAS and the EAS showed significant value to the institution regardless of the timing when the student was identified. The results indicate that EAS had significant financial benefits to this institution and that the benefits extended to the entire institution beyond the first year of enrolment.", "authors": ["Scott Harrison", "Renato Villano", "Grace Lynch", "George Chen"], "session": "SESSION: Institutional perspectives"}, {"title": "Data2U: scalable real time student feedback in active learning environments", "pages": "249-253", "doi": "10.1145/2883851.2883911", "abstract": "The majority of applications and products that use learning analytics to understand and improve learning experiences assume the creation of actionable items that will affect students through an intermediary. Much less focus is devoted to exploring how to provide insight directly to students. Furthermore, student engagement has always been a relevant aspect to increase the quality of a learning experience. Learning analytics techniques can be used to provide real-time insight tightly integrated with the learning outcomes directly to the students. This paper describes a case study deployed in a first year engineering course using a flipped learning strategy to explore the behavior of students interacting with a dashboard updated in real time providing indicators of their engagement with the course activities. The results show different patterns of use and their evolution throughout the experience and shed some light on how students perceived this resource.", "authors": ["Imran Khan", "Abelardo Pardo"], "session": "SESSION: Personalization"}, {"title": "Supporting learning by considering emotions: tracking and visualization a case study", "pages": "254-263", "doi": "10.1145/2883851.2883888", "abstract": "The adequate emotional state of students has proved to be essential for favoring learning. This paper explores the possibility of obtaining students' feedback about the emotions they feel in class in order to discover potential emotion patterns that might indicate learning fails. This paper presents a visual dashboard that allows students to track their emotions and follow up on their evolution during the course. We have compiled the principal classroom related emotions and developed a two-phase inquiry process to: verify the possibility to measure students' emotions in classroom; discover how emotions can be displayed to promote self-reflection; and confirm the impact of emotions on learning performance. Our results suggest that students' emotions in class are related to evaluation marks. This shows that early information about students' emotions can be useful for teachers and students to improve classroom results and learning outcomes.", "authors": ["Samara Ruiz", "Sven Charleer", "Maite Urretavizcaya", "Joris Klerkx", "Isabel Fernández-Castro", "Erik Duval"], "session": "SESSION: Personalization"}, {"title": "A rule-based indicator definition tool for personalized learning analytics", "pages": "264-273", "doi": "10.1145/2883851.2883921", "abstract": "In the last few years, there has been a growing interest in learning analytics (LA) in technology-enhanced learning (TEL). Generally, LA deals with the development of methods that harness educational data sets to support the learning process. Recently, the concept of open learning analytics (OLA) has received a great deal of attention from LA community, due to the growing demand for self-organized, networked, and lifelong learning opportunities. A key challenge in OLA is to follow a personalized and goal-oriented LA model that tailors the LA task to the needs and goals of multiple stakeholders. Current implementations of LA rely on a predefined set of questions and indicators. There is, however, a need to adopt a personalized LA approach that engages end users in the indicator definition process by supporting them in setting goals, posing questions, and self-defining the indicators that help them achieve their goals. In this paper, we address the challenge of personalized LA and present the conceptual, design, and implementation details of a rule-based indicator definition tool to support flexible definition and dynamic generation of indicators to meet the needs of different stakeholders with diverse goals and questions in the LA exercise.", "authors": ["Arham Muslim", "Mohamed Amine Chatti", "Tanmaya Mahapatra", "Ulrik Schroeder"], "session": "SESSION: Personalization"}, {"title": "Designing MOOCs for success: a student motivation-oriented framework", "pages": "274-278", "doi": "10.1145/2883851.2883941", "abstract": "Considerable literature exists regarding MOOCs. Evaluations of MOOCs range from ringing endorsements to its vilification as a delivery model. Much evaluation focuses on completion rates and/or participant satisfaction. Overall, MOOCs are ill-defined and researchers struggle with appropriate evaluation criteria beyond attrition rates. In this paper, we provide a brief history of MOOCs, a summary of some evaluation research, and we propose a new model for evaluation with an example from a previously-delivered MOOC. Measurement of the MOOC success framework through four student satisfaction types is proposed in this paper with a model for informal learning satisfaction, one of the proposed types, theorized and tested. Results indicated theoretical underpinnings, while intended to improve instruction, might not have influenced the same satisfaction construct. Therefore, future research into alternative satisfaction factor models is needed.", "authors": ["Jonathan M. Kevan", "Michael P. Menchaca", "Ellen S. Hoffman"], "session": "SESSION: Theoretical and conceptual models"}, {"title": "The assessment of learning infrastructure (ALI): the theory, practice, and scalability of automated assessment", "pages": "279-288", "doi": "10.1145/2883851.2883872", "abstract": "Researchers invested in K-12 education struggle not just to enhance pedagogy, curriculum, and student engagement, but also to harness the power of technology in ways that will optimize learning. Online learning platforms offer a powerful environment for educational research at scale. The present work details the creation of an automated system designed to provide researchers with insights regarding data logged from randomized controlled experiments conducted within the ASSISTments TestBed. The Assessment of Learning Infrastructure (ALI) builds upon existing technologies to foster a symbiotic relationship beneficial to students, researchers, the platform and its content, and the learning analytics community. ALI is a sophisticated automated reporting system that provides an overview of sample distributions and basic analyses for researchers to consider when assessing their data. ALI's benefits can also be felt at scale through analyses that crosscut multiple studies to drive iterative platform improvements while promoting personalized learning.", "authors": ["Korinn S. Ostrow", "Doug Selent", "Yan Wang", "Eric G. Van Inwegen", "Neil T. Heffernan", "Joseph Jay Williams"], "session": "SESSION: Theoretical and conceptual models"}, {"title": "When to stop?: towards universal instructional policies", "pages": "289-298", "doi": "10.1145/2883851.2883961", "abstract": "The adaptivity of intelligent tutoring systems relies on the accuracy of the student model and the design of the instructional policy. Recently an instructional policy has been presented that is compatible with all common student models. In this work we present the next step towards a universal instructional policy. We introduce a new policy that is applicable to an even wider range of student models including DBNs modeling skill topologies and forgetting. We theoretically and empirically compare our policy to previous policies. Using synthetic and real world data sets we show that our policy can effectively handle wheel-spinning students as well as forgetting across a wide range of student models.", "authors": ["Tanja Käser", "Severin Klingler", "Markus Gross"], "session": "SESSION: Theoretical and conceptual models"}, {"title": "Applying classification techniques on temporal trace data for shaping student behavior models", "pages": "299-303", "doi": "10.1145/2883851.2883926", "abstract": "Differences in learners' behavior have a deep impact on their educational performance. Consequently, there is a need to detect and identify these differences and build suitable learner models accordingly. In this paper, we report on the results from an alternative approach for dynamic student behavioral modeling based on the analysis of time-based student-generated trace data. The goal was to unobtrusively classify students according to their time-spent behavior. We applied 5 different supervised learning classification algorithms on these data, using as target values (class labels) the students' performance score classes during a Computer-Based Assessment (CBA) process, and compared the obtained results. The proposed approach has been explored in a study with 259 undergraduate university participant students. The analysis of the findings revealed that a) the low misclassification rates are indicative of the accuracy of the applied method and b) the ensemble learning (treeBagger) method provides better classification results compared to the others. These preliminary results are encouraging, indicating that a time-spent driven description of the students' behavior could have an added value towards dynamically reshaping the respective models.", "authors": ["Zacharoula Papamitsiou", "Eirini Karapistoli", "Anastasios A. Economides"], "session": "SESSION: Methodological reflections"}, {"title": "Using A/B testing in MOOC environments", "pages": "304-313", "doi": "10.1145/2883851.2883876", "abstract": "In recent years, Massive Open Online Courses (MOOCs) have become a phenomenon offering the possibility to teach thousands of participants simultaneously. In the same time the platforms used to deliver these courses are still in their fledgling stages. While course content and didactics of those massive courses are the primary key factors for the success of courses, still a smart platform may increase or decrease the learners experience and his learning outcome. The paper at hand proposes the usage of an A/B testing framework that is able to be used within an micro-service architecture to validate hypotheses about how learners use the platform and to enable data-driven decisions about new features and settings. To evaluate this framework three new features (Onboarding Tour, Reminder Mails and a Pinboard Digest) have been identified based on a user survey. They have been implemented and introduced on two large MOOC platforms and their influence on the learners behavior have been measured. Finally this paper proposes a data driven decision workflow for the introduction of new features and settings on e-learning platforms.", "authors": ["Jan Renz", "Daniel Hoffmann", "Thomas Staubitz", "Christoph Meinel"], "session": "SESSION: Methodological reflections"}, {"title": "Translating network position into performance: importance of centrality in different network configurations", "pages": "314-323", "doi": "10.1145/2883851.2883928", "abstract": "As the field of learning analytics continues to mature, there is a corresponding evolution and sophistication of the associated analytical methods and techniques. In this regard social network analysis (SNA) has emerged as one of the cornerstones of learning analytics methodologies. However, despite the noted importance of social networks for facilitating the learning process, it remains unclear how and to what extent such network measures are associated with specific learning outcomes. Motivated by Simmel's theory of social interactions and building on the argument that social centrality does not always imply benefits, this study aimed to further contribute to the understanding of the association between students' social centrality and their academic performance. The study reveals that learning analytics research drawing on SNA should incorporate both - descriptive and statistical methods to provide a more comprehensive and holistic understanding of a students' network position. In so doing researchers can undertake more nuanced and contextually salient inferences about learning in network settings. Specifically, we show how differences in the factors framing students' interactions within two instances of a MOOC affect the association between the three social network centrality measures (i.e., degree, closeness, and betweenness) and the final course outcome.", "authors": ["Srećko Joksimović", "Areti Manataki", "Dragan Gašević", "Shane Dawson", "Vitomir Kovanović", "Inés Friss de Kereki"], "session": "SESSION: Proficiency and positioning"}, {"title": "Data-driven proficiency profiling: proof of concept", "pages": "324-328", "doi": "10.1145/2883851.2883935", "abstract": "Data-driven methods have previously been used in intelligent tutoring systems to improve student learning outcomes and predict student learning methods. We have been incorporating data-driven methods for feedback and problem selection into Deep Thought, a logic tutor where students practice constructing deductive logic proofs. In this latest study we have implemented our data-driven proficiency profiler (DDPP) into Deep Thought as a proof of concept. The DDPP determines student proficiency without expert involvement by comparing relevant student rule scores to previous students who behaved similarly in the tutor and successfully completed it. The results show that the DDPP did improve in performance with additional data and proved to be an effective proof of concept.", "authors": ["Behrooz Mostafavi", "Tiffany Barnes"], "session": "SESSION: Proficiency and positioning"}, {"title": "A conceptual framework linking learning design with learning analytics", "pages": "329-338", "doi": "10.1145/2883851.2883944", "abstract": "In this paper we present a learning analytics conceptual framework that supports enquiry-based evaluation of learning designs. The dimensions of the proposed framework emerged from a review of existing analytics tools, the analysis of interviews with teachers, and user scenarios to understand what types of analytics would be useful in evaluating a learning activity in relation to pedagogical intent. The proposed framework incorporates various types of analytics, with the teacher playing a key role in bringing context to the analysis and making decisions on the feedback provided to students as well as the scaffolding and adaptation of the learning design. The framework consists of five dimensions: temporal analytics, tool-specific analytics, cohort dynamics, comparative analytics and contingency. Specific metrics and visualisations are defined for each dimension of the conceptual framework. Finally the development of a tool that partially implements the conceptual framework is discussed.", "authors": ["Aneesha Bakharia", "Linda Corrin", "Paula de Barba", "Gregor Kennedy", "Dragan Gašević", "Raoul Mulder", "David Williams", "Shane Dawson", "Lori Lockyer"], "session": "SESSION: Learning design and analytics"}, {"title": "The impact of 151 learning designs on student satisfaction and performance: social learning (analytics) matters", "pages": "339-343", "doi": "10.1145/2883851.2883875", "abstract": "An increasing number of researchers are taking learning design into consideration when predicting learning behavior and outcomes across different modules. This study builds on preliminary learning design work that was presented at LAK2015 by the Open University UK. In this study we linked 151 modules and 111.256 students with students' satisfaction and performance using multiple regression models. Our findings strongly indicate the importance of learning design in predicting and understanding performance of students in blended and online environments. In line with proponents of social learning analytics, our primary predictor for academic retention was the amount of communication activities, controlling for various institutional and disciplinary factors. Where possible, appropriate communication tasks that align with the learning objectives of the course may be a way forward to enhance academic retention.", "authors": ["Bart Rienties", "Lisette Toetenel"], "session": "SESSION: Learning design and analytics"}, {"title": "Student differences in regulation strategies and their use of learning resources: implications for educational design", "pages": "344-353", "doi": "10.1145/2883851.2883890", "abstract": "The majority of the learning analytics research focuses on the prediction of course performance and modeling student behaviors with a focus on identifying students who are at risk of failing the course. Learning analytics should have a stronger focus on improving the quality of learning for all students, not only identifying at risk students. In order to do so, we need to understand what successful patterns look like when reflected in data and subsequently adjust the course design to avoid unsuccessful patterns and facilitate successful patterns. However, when establishing these successful patterns, it is important to account for individual differences among students since previous research has shown that not all students engage with learning resources to the same extent. Regulation strategies seem to play an important role in explaining the different usage patterns students' display when using digital learning recourses. When learning analytics research incorporates contextualized data about student regulation strategies we are able to differentiate between students at a more granular level. The current study examined if regulation strategies could account for differences in the use of various learning resources. It examines how students regulated their learning process and subsequently used the different learning resources throughout the course and established how this use contributes to course performance. The results show that students with different regulation strategies use the learning resources to the same extent. However, the use of learning resources influences course performance differently for different groups of students. This paper recognizes the importance of contextualization of learning data resources with a broader set of indicators to understand the learning process. With our focus on differences between students, we strive for a shift within learning analytics from identifying at risk students towards a contribution of learning analytics in the educational design process and enhance the quality of learning; for all students.", "authors": ["Nynke Bos", "Saskia Brand-Gruwel"], "session": "SESSION: Learning design and analytics"}, {"title": "Sequencing educational content in classrooms using Bayesian knowledge tracing", "pages": "354-363", "doi": "10.1145/2883851.2883885", "abstract": "Despite the prevalence of e-learning systems in schools, most of today's systems do not personalize educational data to the individual needs of each student. This paper proposes a new algorithm for sequencing questions to students that is empirically shown to lead to better performance and engagement in real schools when compared to a baseline approach. It is based on using knowledge tracing to model students' skill acquisition over time, and to select questions that advance the student's learning within the range of the student's capabilities, as determined by the model. The algorithm is based on a Bayesian Knowledge Tracing (BKT) model that incorporates partial credit scores, reasoning about multiple attempts to solve problems, and integrating item difficulty. This model is shown to outperform other BKT models that do not reason about (or reason about some but not all) of these features. The model was incorporated into a sequencing algorithm and deployed in two classes in different schools where it was compared to a baseline sequencing algorithm that was designed by pedagogical experts. In both classes, students using the BKT sequencing approach solved more difficult questions and attributed higher performance than did students who used the expert-based approach. Students were also more engaged using the BKT approach, as determined by their interaction time and number of log-ins to the system, as well as their reported opinion. We expect our approach to inform the design of better methods for sequencing and personalizing educational content to students that will meet their individual learning needs.", "authors": ["Yossi Ben David", "Avi Segal", "Ya'akov (Kobi) Gal"], "session": "SESSION: Bayesian modeling"}, {"title": "Studying the relationship between BKT fitting error and the skill difficulty index", "pages": "364-368", "doi": "10.1145/2883851.2883901", "abstract": "Bayesian Knowledge Tracing (BKT) is one of the most popular knowledge inference models due to its interpretability and ability to infer student knowledge. A proper student modeling can help guide the behavior of a cognitive tutor system and provide insight to researchers on understanding how students learn. Using four different datasets we study the relationship between the error coming from fitting the parameters and the difficulty index of the skills and the effect of the size of the dataset in this relationship. The relationship between the fitting error and the difficulty index can be very easy modeled and might be indicating some problems with BKTs performance. However, large datasets are required to clearly see this connection as there is an important sample size effect.", "authors": ["Francesc Martori", "Jordi Cuadros", "Lucinio González-Sabaté"], "session": "SESSION: Bayesian modeling"}, {"title": "Modeling common misconceptions in learning process data", "pages": "369-377", "doi": "10.1145/2883851.2883967", "abstract": "Student mistakes are often not random but, rather, reflect thoughtful yet incorrect strategies. In order for educational technologies to make full use of students' performance data to estimate the knowledge of a student, it is important to model not only the conceptions but also the misconceptions that a student's particular pattern of successes and errors may indicate. The student models that drive the \"outer loop\" of Intelligent Tutoring Systems typically do not represent or track misconceptions. Here, we present a method of representing misconceptions in the Knowledge Component models, or Q-Matrices, that are used by student models to estimate latent knowledge. We show, in a case study on a fraction arithmetic dataset, that incorporating a misconception into the Knowledge Component model dramatically improves the overall model's fit to data. We also derive qualitative insights from comparing predicted learning curves across models that incorporate varying misconception-related parameters. Finally, we show that the inclusion of a misconception in the Knowledge Component model can yield individual student estimates of misconception strength that are significantly correlated with out-of-tutor measures of student errors.", "authors": ["Ran Liu", "Rony Patel", "Kenneth R. Koedinger"], "session": "SESSION: Bayesian modeling"}, {"title": "Recipe for success: lessons learnt from using xAPI within the connected learning analytics toolkit", "pages": "378-382", "doi": "10.1145/2883851.2883882", "abstract": "An ongoing challenge for Learning Analytics research has been the scalable derivation of user interaction data from multiple technologies. The complexities associated with this challenge are increasing as educators embrace an ever growing number of social and content-related technologies. The Experience API (xAPI) alongside the development of user specific record stores has been touted as a means to address this challenge, but a number of subtle considerations must be made when using xAPI in Learning Analytics. This paper provides a general overview to the complexities and challenges of using xAPI in a general systemic analytics solution - called the Connected Learning Analytics (CLA) toolkit. The importance of design is emphasised, as is the notion of common vocabularies and xAPI Recipes. Early decisions about vocabularies and structural relationships between statements can serve to either facilitate or handicap later analytics solutions. The CLA toolkit case study provides us with a way of examining both the strengths and the weaknesses of the current xAPI specification, and we conclude with a proposal for how xAPI might be improved by using JSON-LD to formalise Recipes in a machine readable form.", "authors": ["Aneesha Bakharia", "Kirsty Kitto", "Abelardo Pardo", "Dragan Gašević", "Shane Dawson"], "session": "SESSION: xAPI"}, {"title": "Forecasting student achievement in MOOCs with natural language processing", "pages": "383-387", "doi": "10.1145/2883851.2883932", "abstract": "Student intention and motivation are among the strongest predictors of persistence and completion in Massive Open Online Courses (MOOCs), but these factors are typically measured through fixed-response items that constrain student expression. We use natural language processing techniques to evaluate whether text analysis of open responses questions about motivation and utility value can offer additional capacity to predict persistence and completion over and above information obtained from fixed-response items. Compared to simple benchmarks based on demographics, we find that a machine learning prediction model can learn from unstructured text to predict which students will complete an online course. We show that the model performs well out-of-sample, compared to a standard array of demographics. These results demonstrate the potential for natural language processing to contribute to predicting student success in MOOCs and other forms of open online learning.", "authors": ["Carly Robinson", "Michael Yeomans", "Justin Reich", "Chris Hulleman", "Hunter Gehlbach"], "session": "SESSION: Supporting learning and achievement"}, {"title": "Is the doer effect a causal relationship?: how can we tell and why it's important", "pages": "388-397", "doi": "10.1145/2883851.2883957", "abstract": "The \"doer effect\" is an association between the number of online interactive practice activities students' do and their learning outcomes that is not only statistically reliable but has much higher positive effects than other learning resources, such as watching videos or reading text. Such an association suggests a causal interpretation--more doing yields better learning--which requires randomized experimentation to most rigorously confirm. But such experiments are expensive, and any single experiment in a particular course context does not provide rigorous evidence that the causal link will generalize to other course content. We suggest that analytics of increasingly available online learning data sets can complement experimental efforts by facilitating more widespread evaluation of the generalizability of claims about what learning methods produce better student learning outcomes. We illustrate with analytics that narrow in on a causal interpretation of the doer effect by showing that doing within a course unit predicts learning of that unit content more than doing in units before or after. We also provide generalizability evidence across four different courses involving over 12,500 students that the learning effect of doing is about six times greater than that of reading.", "authors": ["Kenneth R. Koedinger", "Elizabeth A. McLaughlin", "Julianna Zhuxin Jia", "Norman L. Bier"], "session": "SESSION: Supporting learning and achievement"}, {"title": "Towards triggering higher-order thinking behaviors in MOOCs", "pages": "398-407", "doi": "10.1145/2883851.2883964", "abstract": "With the aim of better scaffolding discussion to improve learning in a MOOC context, this work investigates what kinds of discussion behaviors contribute to learning. We explored whether engaging in higher-order thinking behaviors results in more learning than paying general or focused attention to course materials. In order to evaluate whether to attribute the effect to engagement in the associated behaviors versus persistent characteristics of the students, we adopted two approaches. First, we used propensity score matching to pair students who exhibit a similar level of involvement in other course activities. Second, we explored individual variation in engagement in higher-order thinking behaviors across weeks. The results of both analyses support the attribution of the effect to the behavioral interpretation. A further analysis using LDA applied to course materials suggests that more social oriented topics triggered richer discussion than more biopsychology oriented topics.", "authors": ["Xu Wang", "Miaomiao Wen", "Carolyn P. Rosé"], "session": "SESSION: Supporting learning and achievement"}, {"title": "A study on eye fixation patterns of students in higher education using an online learning system", "pages": "408-416", "doi": "10.1145/2883851.2883871", "abstract": "We study how the use of online learning systems stimulate cognitive activities, by conducting an experiment with the use of eye tracking technology to monitor eye fixations of 60 final year students engaging in online interactive tutorials at the start of their Final Year Project module. Our findings show that the students' visual scanning behaviours fall into three different types of eye fixation patterns, and the data corresponding to the different types relates to the performance of the students in other related academic modules. We conclude that this method of studying eye fixation patterns can identify different types of learners with respect to cognitive activities and academic potentials, allowing educators to understand how their instructional design using online learning environments can stimulate higher-order cognitive activities.", "authors": ["Benedict The", "Manolis Mavrikis"], "session": "SESSION: Real time data"}, {"title": "A gaze-based learning analytics model: in-video visual feedback to improve learner's attention in MOOCs", "pages": "417-421", "doi": "10.1145/2883851.2883902", "abstract": "In the context of MOOCs, \"With-me-ness\" refers to the extent to which the learner succeeds in following the teacher, specifically in terms of looking at the area in the video that the teacher is explaining. In our previous works, we employed eye-tracking methods to quantify learners' With-me-ness and showed that it is positively correlated with their learning gains. In this contribution, we describe a tool that is designed to improve With-me-ness by providing a visual-aid superimposed on the video. The position of the visual-aid is suggested by the teachers' dialogue and deixis, and it is displayed when the learner's With-me-ness is under the average value, which is computed from the other students' gaze behavior. We report on a user-study that examines the effectiveness of the proposed tool. The results show that it significantly improves the learning gain and it significantly increases the extent to which the students follow the teacher. Finally, we demonstrate how With-me-ness can create a complete theoretical framework for conducting gaze-based learning analytics in the context of MOOCs.", "authors": ["Kshitij Sharma", "Hamed S. Alavi", "Patrick Jermann", "Pierre Dillenbourg"], "session": "SESSION: Real time data"}, {"title": "Exploring the relation between self-regulation, online activities, and academic performance: a case study", "pages": "422-429", "doi": "10.1145/2883851.2883883", "abstract": "The areas of educational data mining and learning analytics focus on the extraction of knowledge and actionable items from data sets containing detailed information about students. However, the potential impact from these techniques is increased when properly contextualized within a learning environment. More studies are needed to explore the connection between student interactions, approaches to learning, and academic performance. Self-regulated learning (SRL) is defined as the extent to which a student is able to motivationally, metacognitively, and cognitively engage in a learning experience. SRL has been the focus of research in traditional classroom learning and is also argued to play a vital role in the online or blended learning contexts. In this paper, we study how SRL affects students' online interactions with various learning activities and its influence in academic performance. The results derived from a naturalistic experiment among a cohort of first year engineering students showed that positive self-regulated strategies (PSRS) and negative self-regulated strategies (NSRS) affected both the interaction with online activities and academic performance. NSRS directly predicted academic outcomes, whereas PSRS only contributed indirectly to academic performance via the interactions with online activities. These results point to concrete avenues to promote self-regulation among students in this type of learning contexts.", "authors": ["Abelardo Pardo", "Feifei Han", "Robert A. Ellis"], "session": "SESSION: Supporting SRL and 21st century skills"}, {"title": "Fostering 21st century literacies through a collaborative critical reading and learning analytics environment: user-perceived benefits and problematics", "pages": "430-434", "doi": "10.1145/2883851.2883965", "abstract": "The affordances of learning analytics (LA) are being increasingly harnessed to enhance 21st century (21C) pedagogy and learning. Relatively rare, however, are use cases and empirically based understandings of students' actual experiences with LA tools and environments at fostering 21C literacies, especially in secondary schooling and Asian education contexts. This paper addresses this knowledge gap by 1) presenting a first iteration design of a computer-supported collaborative critical reading and LA environment and its 16-week implementation in a Singapore high school; and 2) foregrounding students' quantitative and qualitative accounts of the benefits and problematics associated with this learning innovation. We focus the analytic lens on the LA dashboard components that provided visualizations of students' reading achievement, 21C learning dispositions, critical literacy competencies and social learning network positioning within the class. The paper aims to provide insights into the potentialities, paradoxes and pathways forward for designing LA that take into consideration the voices of learners as critical stakeholders.", "authors": ["Jennifer Pei-Ling Tan", "Simon Yang", "Elizabeth Koh", "Christin Jonathan"], "session": "SESSION: Supporting SRL and 21st century skills"}, {"title": "Improving efficacy attribution in a self-directed learning environment using prior knowledge individualization", "pages": "435-439", "doi": "10.1145/2883851.2883949", "abstract": "Models of learning in EDM and LAK are pushing the boundaries of what can be measured from large quantities of historical data. When controlled randomization is present in the learning platform, such as randomized ordering of problems within a problem set, natural quasi-randomized controlled studies can be conducted, post-hoc. Difficulty and learning gain attribution are among factors of interest that can be studied with secondary analyses under these conditions. However, much of the content that we might like to evaluate for learning value is not administered as a random stimulus to students but instead is being self-selected, such as a student choosing to seek help in the discussion forums, wiki pages, or other pedagogically relevant material in online courseware. Help seekers, by virtue of their motivation to seek help, tend to be the ones who have the least knowledge. When presented with a cohort of students with a bi-modal or uniform knowledge distribution, this can present problems with model interpretability when a single point estimation is used to represent cohort prior knowledge. Since resource access is indicative of a low knowledge student, a model can tend towards attributing the resources with low or negative learning gain in order to better explain performance given the higher average prior point estimate. In this paper we present several individualized prior strategies and demonstrate how learning efficacy attribution validity and prediction accuracy improve as a result. Level of education attained, relative past assessment performance, and the prior per student cold start heuristic were employed and compared as prior knowledge individualization strategies.", "authors": ["Zachary A. Pardos", "Yanbo Xu"], "session": "SESSION: Supporting SRL and 21st century skills"}, {"title": "Using game analytics to evaluate puzzle design and level progression in a serious game", "pages": "440-448", "doi": "10.1145/2883851.2883953", "abstract": "Our previous work has demonstrated that players who perceive a game as more challenging are likely to perceive greater learning from that game [8]. However, this may not be the case for all sources of challenge. In this study of a Science learning game called Quantum Spectre, we found that students' progress through the first zone of the game seemed to encounter a \"roadblock\" during gameplay, dropping out when they cannot (or do not want to) progress further. Previously we had identified two primary types of errors in the learning game, Quantum Spectre: Science Errors related to the game's core educational content; and Puzzle Errors related to rules of the game but not to science knowledge. Using this prior analysis, alongside Survival Analysis techniques for analyzing time-series data and drop-out rates, we explored players' gameplay patterns to help us understand player dropout in Quantum Spectre. These results demonstrate that modeling player behavior can be useful for both assessing learning and for designing complex problem solving content for learning environments.", "authors": ["Drew Hicks", "Michael Eagle", "Elizabeth Rowe", "Jodi Asbell-Clarke", "Teon Edwards", "Tiffany Barnes"], "session": "SESSION: Overcoming obstacles"}, {"title": "Bayesian modelling of student misconceptions in the one-digit multiplication with probabilistic programming", "pages": "449-453", "doi": "10.1145/2883851.2883895", "abstract": "One-digit multiplication errors are one of the most extensively analysed mathematical problems. Research work primarily emphasises the use of statistics whereas learning analytics can go one step further and use machine learning techniques to model simple learning misconceptions. Probabilistic programming techniques ease the development of probabilistic graphical models (bayesian networks) and their use for prediction of student behaviour that can ultimately influence learning decision processes.", "authors": ["Behnam Taraghi", "Anna Saranti", "Robert Legenstein", "Martin Ebner"], "session": "SESSION: Overcoming obstacles"}, {"title": "Enhancing the efficiency and reliability of group differentiation through partial credit", "pages": "454-458", "doi": "10.1145/2883851.2883910", "abstract": "The focus of the learning analytics community bridges the gap between controlled educational research and data mining. Online learning platforms can be used to conduct randomized controlled trials to assist in the development of interventions that increase learning gains; datasets from such research can act as a treasure trove for inquisitive data miners. The present work employs a data mining approach on randomized controlled trial data from ASSISTments, a popular online learning platform, to assess the benefits of incorporating additional student performance data when attempting to differentiate between two user groups. Through a resampling technique, we show that partial credit, defined as an algorithmic combination of binary correctness, hint usage, and attempt count, can benefit assessment and group differentiation. Partial credit reduces sample sizes required to reliably differentiate between groups that are known to differ by 58%, and reduces sample sizes required to reliably differentiate between less distinct groups by 9%.", "authors": ["Yan Wang", "Korinn Ostrow", "Joseph Beck", "Neil Heffernan"], "session": "SESSION: Overcoming obstacles"}, {"title": "What and when: the role of course type and timing in students' academic performance", "pages": "459-468", "doi": "10.1145/2883851.2883907", "abstract": "In this paper we discuss the results of a study of students' academic performance in first year general education courses. Using data from 566 students who received intensive academic advising as part of their enrollment in the institution's pre-major/general education program, we investigate individual student, organizational, and disciplinary factors that might predict a students' potential classification in an Early Warning System as well as factors that predict improvement and decline in their academic performance. Disciplinary course type (based on Biglan's [7] typology) was significantly related to a student's likelihood to enter below average performance classifications. Students were the most likely to enter a classification in fields like the natural science, mathematics, and engineering in comparison to humanities courses. We attribute these disparities in academic performance to disciplinary norms around teaching and assessment. In particular, the timing of assessments played a major role in students' ability to exit a classification. Implications for the design of Early Warning analytics systems as well as academic course planning in higher education are offered.", "authors": ["Michael Geoffrey Brown", "R. Matthew DeMonbrun", "Steven Lonn", "Stephen J. Aguilar", "Stephanie D. Teasley"], "session": "SESSION: Predictive modelling"}, {"title": "Predicting student performance on post-requisite skills using prerequisite skill data: an alternative method for refining prerequisite skill structures", "pages": "469-473", "doi": "10.1145/2883851.2883867", "abstract": "Prerequisite skill structures have been closely studied in past years leading to many data-intensive methods aimed at refining such structures. While many of these proposed methods have yielded success, defining and refining hierarchies of skill relationships are often difficult tasks. The relationship between skills in a graph could either be causal, therefore, a prerequisite relationship (skill A must be learned before skill B). The relationship may be non-causal, in which case the ordering of skills does not matter and may indicate that both skills are prerequisites of another skill. In this study, we propose a simple, effective method of determining the strength of pre-to-post-requisite skill relationships. We then compare our results with a teacher-level survey about the strength of the relationships of the observed skills and find that the survey results largely confirm our findings in the data-driven approach.", "authors": ["Seth A. Adjei", "Anthony F. Botelho", "Neil T. Heffernan"], "session": "SESSION: Predictive modelling"}, {"title": "Generating actionable predictive models of academic performance", "pages": "474-478", "doi": "10.1145/2883851.2883870", "abstract": "The pervasive collection of data has opened the possibility for educational institutions to use analytics methods to improve the quality of the student experience. However, the adoption of these methods faces multiple challenges particularly at the course level where instructors and students would derive the most benefit from the use of analytics and predictive models. The challenge lies in the knowledge gap between how the data is captured, processed and used to derive models of student behavior, and the subsequent interpretation and the decision to deploy pedagogical actions and interventions by instructors. Simply put, the provision of learning analytics alone has not necessarily led to changing teaching practices. In order to support pedagogical change and aid interpretation, this paper proposes a model that can enable instructors to readily identify subpopulations of students to provide specific support actions. The approach was applied to a first year course with a large number of students. The resulting model classifies students according to their predicted exam scores, based on indicators directly derived from the learning design.", "authors": ["Abelardo Pardo", "Negin Mirriahi", "Roberto Martinez-Maldonado", "Jelena Jovanovic", "Shane Dawson", "Dragan Gašević"], "session": "SESSION: Predictive modelling"}, {"title": "Learning design and feedback processes at scale: stocktaking emergent theory and practice", "pages": "479-480", "doi": "10.1145/2883851.2883856", "abstract": "Design for learning in scaled courses is shifting away from replication of traditional on-campus or online teaching towards exploiting the distinctive characteristic and potentials of scale to transform both teaching and learning. Scaled learning environments such as MOOCs may represent a new paradigm for teaching. This workshop involves consideration of the how learning occurs in scaled environments, and how learning designers and analysts can assist. It will explore questions at the heart of effective learning design, using expert panelists and collaborative knowledge-building techniques to arrive at a stocktake of thinking.", "authors": ["Ulla Ringtved", "Sandra Milligan", "Linda Corrin"], "session": "WORKSHOP SESSION: Workshops"}, {"title": "Critical perspectives on writing analytics", "pages": "481-483", "doi": "10.1145/2883851.2883854", "abstract": "Writing Analytics focuses on the measurement and analysis of written texts for the purpose of understanding writing processes and products, in their educational contexts, and improving the teaching and learning of writing. This workshop adopts a critical, holistic perspective in which the definition of \"the system\" and \"success\" is not restricted to IR metrics such as precision and recall, but recognizes the many wider issues that aid or obstruct analytics adoption in educational settings, such as theoretical and pedagogical grounding, usability, user experience, stakeholder design engagement, practitioner development, organizational infrastructure, policy and ethics.", "authors": ["Simon Buckingham Shum", "Simon Knight", "Danielle McNamara", "Laura Allen", "Duygu Bektik", "Scott Crossley"], "session": "WORKSHOP SESSION: Workshops"}, {"title": "Learning analytics for workplace and professional learning", "pages": "484-485", "doi": "10.1145/2883851.2883860", "abstract": "Recognizing the need for addressing the rather fragmented character of research in this field, we have held a workshop on learning analytics for workplace and professional learning at the Learning Analytics and Knowledge (LAK) Conference. The workshop has taken a broad perspective, encompassing approaches from a number of previous traditions, such as adaptive learning, professional online communities, workplace learning and performance analytics. Being co-located with the LAK conference has provided an ideal venue for addressing common challenges and for benefiting from the strong research on learning analytics in other sectors that LAK has established. Learning Analytics for Workplace and Professional Learning is now on the research agenda of several ongoing EU projects, and therefore a number of follow-up activities are planned for strengthening integration in this emerging field.", "authors": ["Tobias Ley", "Ralf Klamma", "Stefanie Lindstaedt", "Fridolin Wild"], "session": "WORKSHOP SESSION: Workshops"}, {"title": "Cross-LAK: learning analytics across physical and digital spaces", "pages": "486-487", "doi": "10.1145/2883851.2883855", "abstract": "It is of high relevance to the LAK community to explore blended learning scenarios where students can interact at diverse digital and physical learning spaces. This workshop aims to gather the sub-community of LAK researchers, learning scientists and researchers from other communities, interested in ubiquitous, mobile and/or face-to-face learning analytics. An overarching concern is how to integrate and coordinate learning analytics to provide continued support to learning across digital and physical spaces. The goals of the workshop are to share approaches and identify a set of guidelines to design and connect Learning Analytics solutions according to the pedagogical needs and contextual constraints to provide support across digital and physical learning spaces.", "authors": ["Roberto Martinez-Maldonado", "Davinia Hernandez-Leo", "Abelardo Pardo", "Dan Suthers", "Kirsty Kitto", "Sven Charleer", "Naif Radi Aljohani", "Hiroaki Ogata"], "session": "WORKSHOP SESSION: Workshops"}, {"title": "Putting temporal analytics into practice: the 5th international workshop on temporality in learning data", "pages": "488-489", "doi": "10.1145/2883851.2883865", "abstract": "Interest in temporal analytics---analytics that probe temporal aspects of learning so as to gain insights into the processes through which learning occurs---continues to grow. The relationships of temporal patterns to learning outcomes is a central area of interest. However, while the literature on temporal analyses is developing, there has been less consideration of the methods by which temporal analyses might be translated to actionable insights and thus, put into use in educational practice. Emerging temporal analysis techniques present both theoretical and practical challenges for producing and interpreting results. Synergetic actions are needed in order to support practitioners.", "authors": ["Bodong Chen", "Alyssa F. Wise", "Simon Knight", "Britte Haugan Cheng"], "session": "WORKSHOP SESSION: Workshops"}, {"title": "LAK16 workshop: extending IMS caliper analytics™ with learning activity profiles", "pages": "490-491", "doi": "10.1145/2883851.2883858", "abstract": "Educational institutions are evolving away from the one-application-fits-all learning management system to a loosely connected digital learning ecosystem comprising diverse services that increasingly leverage data analytics to drive pedagogical innovation. Yet an ecosystem rich in services but lacking a common approach to measuring learning activity will find data collection, aggregation and analysis time-consuming and costly. The IMS Caliper Analytics™ specification addresses the need for data and semantic interoperability by providing an extensible information model, controlled vocabularies and an API for instrumenting learning applications and systems that log learning events. However, many learning activities have yet to be modeled by the Caliper working group. Engaging the SoLAR community directly in this effort will help ensure that the needs of researchers and other consumers of learning analytics data will inform future versions of the specification. The LAK16 Caliper workshop is being offered with this goal in mind. The half-day session, facilitated by members of Team Caliper, will provide LAK16 participants with an opportunity to extend the Caliper specification by modeling new learning activity profiles. New profiles, new connections and new friendships are expected outcomes.", "authors": ["Anthony Whyte", "Prashant Nayak", "John Johnston"], "session": "WORKSHOP SESSION: Workshops"}, {"title": "Ethical and privacy issues in the design of learning analytics applications", "pages": "492-493", "doi": "10.1145/2883851.2883933", "abstract": "Issues related to Ethics and Privacy have become a major stumbling block in application of Learning Analytics technologies on a large scale. Recently, the learning analytics community at large has more actively addressed the EP4LA issues, and we are now starting to see learning analytics solutions that are designed not only as an afterthought, but also with these issues in mind. The 2nd EP4LA@LAK16 workshop will bring the discussion on ethics and privacy for learning analytics to a the next level, helping to build an agenda for organizational and technical design of LA solutions, addressing the different processes of a learning analytics workflow.", "authors": ["Hendrik Drachsler", "Tore Hoel", "Adam Cooper", "Gábor Kismihók", "Alan Berg", "Maren Scheffel", "Weiqin Chen", "Rebecca Ferguson"], "session": "WORKSHOP SESSION: Workshops"}, {"title": "Learning analytics for curriculum and program quality improvement (PCLA 2016)", "pages": "494-495", "doi": "10.1145/2883851.2883899", "abstract": "This workshop on Learning Analytics for Curriculum and Program Quality Improvement investigates how LAK can drive improvements in teaching practices, instructional and curricular design, and academic program delivery. This workshop brings forward research and examples of how LAK can help build the case for instructional, curricular, or programmatic change and further how LAK can be used to foster acceptance of change processes by teachers, administrators, and other stakeholders in the educational enterprise.", "authors": ["Jim Greer", "Marco Molinaro", "Xavier Ochoa", "Timothy McKay"], "session": "WORKSHOP SESSION: Workshops"}, {"title": "LAL workshop: learning analytics for learners", "pages": "496-497", "doi": "10.1145/2883851.2883852", "abstract": "With the arrival of 'big data; in education, the potential was recognised for learning analytics to track students' learning, to reveal patterns in their learning, or to identify at-risk students, in addition to guiding reform and supporting educators in improving teaching and learning processes [1]. Learning Analytics dashboards have been used at all levels, including institutional, regional and national level [2]. In classroom use, while learning visualisations are often based on counts of activity data or interaction patterns, there is increasing recognition that learning analytics relate to learning, and should therefore provide pedagogically useful information [3]. While increasing numbers of technology-enhanced learning applications are embracing the potential of learning analytics at the classroom level, often these are aimed at teachers. However, learners can also benefit from learning analytics data (e.g. [4][5]).", "authors": ["S. Bull", "B. Ginon", "J. Kay", "M. Kickmeier-Rust", "M. D. Johnson"], "session": "WORKSHOP SESSION: Workshops"}, {"title": "Multimodal learning analytics data challenges", "pages": "498-499", "doi": "10.1145/2883851.2883913", "abstract": "This is a proposal for organizing a Multimodal Learning Analytics (MLA) data challenge as part of the workshop offering of the Learning Analytics and Knowledge (LAK) conference. It explains the motivation of the event, its objectives, target groups, expected format, organization, dissemination strategy and schedule.", "authors": ["Xavier Ochoa", "Marcelo Worsley", "Nadir Weibel", "Sharon Oviatt"], "session": "WORKSHOP SESSION: Workshops"}, {"title": "Data literacy for learning analytics", "pages": "500-501", "doi": "10.1145/2883851.2883864", "abstract": "This workshop explores how data literacy impacts on learning analytics both for practitioners and for end users. The term data literacy is used to broadly describe the set of abilities around the use of data as part of everyday thinking and reasoning for solving real-world problems. It is a skill required both by learning analytics practitioners to derive actionable insights from data and by the intended end users, such that it affects their ability to accurately interpret and critique presented analysis of data. The latter is particularly important, since learning analytics outcomes can be targeted at a wide range of end users, some of whom will be young students and many of whom are not data specialists. Whilst data literacy is rarely an end goal of learning analytics projects, this workshop aims to find where issues related to data literacy have impacted on project outcomes and where important insights have been gained. This workshop will further encourage the sharing of knowledge and experience through practical activities with datasets and visualisations. This workshop aims to highlight the need for a greater understanding of data literacy as a field of study, especially with regard to communicating around large, complex, data sets.", "authors": ["Annika Wolff", "John Moore", "Zdenek Zdrahal", "Martin Hlosta", "Jakub Kuzilek"], "session": "WORKSHOP SESSION: Workshops"}, {"title": "Smart environments and analytics on video-based learning", "pages": "502-504", "doi": "10.1145/2883851.2883898", "abstract": "The International Workshop of Smart Environments and Analytics on Video-Based Learning (SE@VBL) aims to connect research efforts on Video-Based Learning with Smart Environments and Analytics to create synergies between these fields. The main objective is to build a research community around the intersection of these topical areas. In particular, SE@VBL aims to develop a critical discussion about the next generation of video-based learning environments and their analytics, the form of these analytics and the way they can be analyzed in order to help us to better understand and improve the value of educational videos to support teaching and learning. SE@VBL is based on the rationale that combining and analyzing learners' interactions with other available data obtained from learners, new avenues for research on video-based learning have emerged. This can have a significant impact in current educational trends such as Massive Open Online Courses (MOOCs) and Flipped Classroom.", "authors": ["Michail N. Giannakos", "Demetrios G. Sampson", "Łukasz Kidziński", "Abelardo Pardo"], "session": "WORKSHOP SESSION: Workshops"}, {"title": "Introduction to data mining for educational researchers", "pages": "505-506", "doi": "10.1145/2883851.2883879", "abstract": "The goal of this tutorial is to share data mining tools and techniques used by computer scientists with educational social scientists. We broadly define educational social scientists as being made up of people with backgrounds in the learning sciences, cognitive psychology, and educational research. The learning analytics community is heavily populated with researchers of these backgrounds, and we believe those that find themselves at the intersection of research, theory, and practice have a particular interest in expanding their knowledge of datadriven tools and techniques.", "authors": ["Christopher A. Brooks", "Craig Thompson", "Vitomir Kovanović"], "session": "WORKSHOP SESSION: Workshops"}, {"title": "Educational data mining with Python and Apache spark: a hands-on tutorial", "pages": "507-508", "doi": "10.1145/2883851.2883857", "abstract": "Enormous amount of educational data has been accumulated through Massive Open Online Courses (MOOCs), as well as commercial and non-commercial learning platforms. This is in addition to the educational data released by US government since 2012 to facilitate disruption in education by making data freely available. The high volume, variety and velocity of collected data necessitate use of big data tools and storage systems such as distributed databases for storage and Apache Spark for analysis. This tutorial will introduce researchers and faculty to real-world applications involving data mining and predictive analytics in learning sciences. In addition, the tutorial will introduce statistics required to validate and accurately report results. Topics will cover how big data is being used to transform education. Specifically, we will demonstrate how exploratory data analysis, data mining, predictive analytics, machine learning, and visualization techniques are being applied to educational big data to improve learning and scale insights driven from millions of student's records. The tutorial will be held over a half day and will be hands on with pre-posted material. Due to the interdisciplinary nature of work, the tutorial appeals to researchers from a wide range of backgrounds including big data, predictive analytics, learning sciences, educational data mining, and in general, those interested in how big data analytics can transform learning. As a prerequisite, attendees are required to have familiarity with at least one programming language.", "authors": ["Lalitha Agnihotri", "Shirin Mojarad", "Nicholas Lewkow", "Alfred Essa"], "session": "WORKSHOP SESSION: Workshops"}, {"title": "LAK failathon", "pages": "509-511", "doi": "10.1145/2883851.2883918", "abstract": "As in many fields, most papers in the learning analytics literature report success or, at least, read as if they are reporting success. This is almost certainly not because learning analytics research and activity are always successful. Generally, we report our successes widely, but keep our failures to ourselves. As Bismarck is alleged to have said: it is wise to learn from the mistakes of others. This workshop offers an opportunity for researchers and practitioners to share their failures in a lower-stakes environment, to help them learn from each other's mistakes.", "authors": ["Doug Clow", "Rebecca Ferguson", "Leah Macfadyen", "Paul Prinsloo", "Sharon Slade"], "session": "WORKSHOP SESSION: Workshops"}, {"title": "Learning through goal setting", "pages": "512-513", "doi": "10.1145/2883851.2883859", "abstract": "Despite the mounting evidence supporting the role that goal setting has on the learning process, there seems to be only a handful of studies that directly investigate goal setting in the context of Learning Analytics (LA). Although investigations have incorporated elements of goal setting, the attention afforded to theory and operationalization have been modest. In this workshop we plan to position goal setting at the forefront of LA research. The workshop will serve as a venue to bring together researchers interested in advancing Goal Setting (GS) research in the LA field. Topics include: (1) GS theory and measurement; (2) analysis and visualization of GS data; (3) strategies for integrating GS in the learning experience; and (4) implementation of GS technologies. Participants who need tools to execute their GS ideas and those who already have tools and are exploring better ways to integrate a goal setting feature can gain a lot from this workshop. Moreover, participants will have the opportunity to contribute to the conceptualization and staging of GS ideas in LA research.", "authors": ["Stefan Mol", "Vladimer Kobayashi", "Gábor Kismihók", "Catherine Zhao"], "session": "WORKSHOP SESSION: Workshops"}, {"title": "Learning analytics in a flipped university course", "pages": "514-515", "doi": "10.1145/2883851.2883874", "abstract": "In this poster, we describe the design of a university course with a blended learning character. Learning analytics were used both within the course to facilitate effective teacher-student interaction, as well as after the course to examine patterns between students' activities during the course and their performance on the test and the group assignment at the end of the course.", "authors": ["Anouschka van Leeuwen"], "session": "POSTER SESSION: Posters"}, {"title": "Multimodal analytics to study collaborative problem solving in pair programming", "pages": "516-517", "doi": "10.1145/2883851.2883877", "abstract": "Collaborative problem solving (CPS) is seen as a key skill in K-12 education---in computer science as well as other subjects. Efforts to introduce children to computing rely on pair programming as a way of having young learners engage in CPS. Characteristics of quality collaboration are joint exploring or understanding, joint representation, and joint execution. We present a data driven approach to assessing and elucidating collaboration through modeling of multimodal student behavior and performance data.", "authors": ["Shuchi Grover", "Marie Bienkowski", "Amir Tamrakar", "Behjat Siddiquie", "David Salter", "Ajay Divakaran"], "session": "POSTER SESSION: Posters"}, {"title": "Automating assessment of collaborative writing quality in multiple stages: the case of wiki", "pages": "518-519", "doi": "10.1145/2883851.2883963", "abstract": "This study attempts to investigate to what extent indicators of academic writing and cognitive thinking can help measure the writing quality of group collaborative writings on Wikis. Particularly, comparisons were made on Wiki content in different stages of the projects. Preliminary results from a multiple linear regression analysis reveal that linguistic indicators such as engagement markers and self-mention were significant predictors in earlier stages to the projects, whereas verbs indicating cognitive thinking in the evaluation level were significant in later project stages.", "authors": ["Xiao Hu", "Tzi-Dong Jeremy Ng", "Lu Tian", "Chi-Un Lei"], "session": "POSTER SESSION: Posters"}, {"title": "Learning analytics community exchange: evidence hub", "pages": "520-521", "doi": "10.1145/2883851.2883878", "abstract": "This poster sets out the background and development of the LACE Evidence Hub, a site that gathers evidence about learning analytics in an accessible form. The poster also describes the functionality of the site, summarises its quantitative and thematic content to date, and assesses the state of evidence. In addition, it encourages people to add to and make use of the Hub.", "authors": ["Rebecca Ferguson", "Doug Clow"], "session": "POSTER SESSION: Posters"}, {"title": "Exploring the interplay between human and machine annotated multimodal learning analytics in hands-on STEM activities", "pages": "522-523", "doi": "10.1145/2883851.2883920", "abstract": "This poster explores how to develop a working framework for STEM education that uses both human annotated and machine data across a purpose-built learning environment. Our dual approach is to develop a robust framework for analysis and investigate how to design a learning analytics system to support hands-on engineering design tasks. Data from the first user tests are presented along with the framework for discussion.", "authors": ["Daniel Spikol", "Katerina Avramides", "Mutlu Cukurova", "Bahtijar Vogel", "Rose Luckin", "Emanuele Ruffaldi", "Manolis Mavrikis"], "session": "POSTER SESSION: Posters"}, {"title": "Using machine analysis to make elementary students' mathematical thinking visible", "pages": "524-525", "doi": "10.1145/2883851.2883922", "abstract": "The INK-12: Teaching and Learning Using Interactive Ink Inscriptions in K-12 project has been developing and investigating the use of pen-based technology in elementary math classes. This paper reports on progress made on machine analysis of students' visual representations created using digital tools developed to support learning multiplication and division. The goal of the analysis is to make student thinking visible in order to (a) better understand how students learn multiplication and division, and (b) provide feedback to teachers, e.g., about strategies students use to solve problems. Student work from a five-week trial in a third grade class provides a corpus for development and evaluation of the machine analysis routines. Preliminary findings indicate that the routines can reproduce human analyses.", "authors": ["Kimberle Koile", "Andee Rubin", "Steve Chapman", "Marlene Kliman", "Lily Ko"], "session": "POSTER SESSION: Posters"}, {"title": "Benchmarking student performance and engagement in an early alert predictive system using interactive radar charts", "pages": "526-527", "doi": "10.1145/2883851.2883940", "abstract": "This poster synthesizes the design features of a visualization layer applied on the Open Academic Analytics Initiative (OAAI), an open source academic early alert system based on predictive analytics. The poster explores ways to convey the predictive model outputs and benchmark student performances using visually intuitive radar plots.", "authors": ["Sandeep M. Jayaprakash", "Eitel J. M. Lauría", "Pritesh Gandhi", "Dinesh Mendhe"], "session": "POSTER SESSION: Posters"}, {"title": "Student affect during learning with a MOOC", "pages": "528-529", "doi": "10.1145/2883851.2883960", "abstract": "This paper presents affect data collected from periodic emotion detection surveys throughout an introductory Statistics MOOC called \"I Heart Stats.\" This is the first MOOC, to our knowledge, to capture valuable student affect data through self-reported surveys. To collect student affect, we used two self-reporting methods: (1) The Self-Assessment Manikin and (2) A discrete emotion list. We found that the most common reported MOOC emotion was Hope followed by Enjoyment and Contentment. There were substantial shifts in affective states over the course, notably with Anxiety and Pride. The most valuable result of our study is a preliminary description of the methods for collecting self-reported student affect at scale in a MOOC setting.", "authors": ["John Dillon", "G. Alex Ambrose", "Nirandika Wanigasekara", "Malolan Chetlur", "Prasenjit Dey", "Bikram Sengupta", "Sidney K. D'Mello"], "session": "POSTER SESSION: Posters"}, {"title": "Integrating physical activity data in videogames with user-centered dashboards", "pages": "530-531", "doi": "10.1145/2883851.2883958", "abstract": "To promote healthy awareness and activity learning, we gave 12-to 14-year-old youth activity monitors (Fitbits) to track their physical activity, which was then integrated into a videogame we created. The players' real-world steps transform into in-game resources needed for gameplay. In addition to requiring real-world steps for various in-game activities, a dashboard in this game presents visual representations of activity patterns, ostensibly informing students about patterns of their own activity. In this paper and poster, we discuss challenges in initial designs of our dashboard. We present findings and challenges in the process of creating a user-centered dashboard and conclude with our future design goals.", "authors": ["Danielle Hagood", "Cynthia Carter Ching", "Sara Schaefer"], "session": "POSTER SESSION: Posters"}, {"title": "Understanding learning at a glance: an overview of learning dashboard studies", "pages": "532-533", "doi": "10.1145/2883851.2883930", "abstract": "Research on learning dashboards aims to identify what data is meaningful to different stakeholders in education, and how data can be presented to support sense-making processes. This paper summarizes the main outcomes of a systematic literature review on learning dashboards, in the fields of Learning Analytics and Educational Data Mining. The query was run in five main academic databases and enriched with papers coming from GScholar, resulting in 346 papers out of which 55 were included in the final analysis. Our review distinguishes different kinds of research studies as well as different aspects of learning dashboards and their maturity in terms of evaluation. As the research field is still relatively young, many of the studies are exploratory and proof-of-concept. Among the main open issues and future lines of work in the area of learning dashboards, we identify the need for longitudinal research in authentic settings, as well as studies that systematically compare different dashboard design options.", "authors": ["Beat A. Schwendimann", "María Jesús Rodríguez-Triana", "Andrii Vozniuk", "Luis P. Prieto", "Mina Shirvani Boroujeni", "Adrian Holzer", "Denis Gillet", "Pierre Dillenbourg"], "session": "POSTER SESSION: Posters"}, {"title": "Reviewing three case-studies of learning analytics interventions at the open university UK", "pages": "534-535", "doi": "10.1145/2883851.2883886", "abstract": "This study provides a conceptual framework how organizations may adopt evidence-based interventions at scale, and how institutions may evaluate the costs and benefits of such interventions. Building on a new conceptual model developed by the Open University UK (OU), we will analyse three case-studies of evidence-based interventions. By working with 90+ large-scale modules for a period of two years across the five faculties and disciplines within the OU, Analytics4Action provides a bottom-up-approach for working together with key stakeholders within their respective contexts. Using principles of embedded case-study approaches by Yin [1], by comparing the learning behavior, satisfaction and performance of 11079 learners the findings indicated that each of the three learning designs led to satisfied students and average to good student retention. In the second part we highlighted that the three module teams made in-presentation interventions based upon real-time analytics, whereby initial user data indicated VLE behaviour in line with expectations. In 2-5 years, we hope that a rich, robust evidence-base will be presented to show how learning analytics can help teachers to make informed, timely and successful interventions that will help learners to achieve their learning outcomes.", "authors": ["Bart Rienties", "Avinash Boroowa", "Simon Cross", "Lee Farrington-Flint", "Christothea Herodotou", "Lynda Prescott", "Kevin Mayles", "Tom Olney", "Lisette Toetenel", "John Woodthorpe"], "session": "POSTER SESSION: Posters"}, {"title": "Analyzing students' intentionality towards badges within a case study using Khan academy", "pages": "536-537", "doi": "10.1145/2883851.2883947", "abstract": "One of the most common gamification techniques in education is the use of badges as a reward for making specific student actions. We propose two indicators to gain insight about students' intentionality towards earning badges and use them with data from 291 students interacting with Khan Academy courses. The intentionality to earn badges was greater for repetitive badges, and this can be related to the fact that these are easier to achieve. We provide the general distribution of students depending on these badge indicators, obtaining different profiles of students which can be used for adaptation purposes.", "authors": ["José A. Ruipérez-Valiente", "Pedro J. Muñoz-Merino", "Carlos Delgado Kloos"], "session": "POSTER SESSION: Posters"}, {"title": "Learning analytics in practice: the effects of adaptive educational technology Snappet on students' arithmetic skills", "pages": "538-539", "doi": "10.1145/2883851.2883892", "abstract": "Even though the recent influx of tablets in primary education goes together with the vision that educational technology empowered with learning analytics will revolutionize education, empirical results supporting this claim are scares. Adaptive educational technology Snappet combines extracted and embedded learning analytics daily in classrooms. While students make exercises on the tablet this technology displays real-time data of learner performance in a teacher dashboard (extracted analytics). At the same time, learner performance is used to adaptively adjust exercises to students' progress (embedded analytics). This quasiexperimental study compares the development of students' arithmetic skills over one schoolyear (grade 2 and 4) in a traditional paper based setting to learning with the adaptive educational technology Snappet. The results indicate that students in the Snappet condition make significantly more progress on arithmetic skills in grade 4. Moreover, in this grade students with a high ability level, benefit the most from working with this adaptive educational technology. Overall the development pattern of students with different abilities was more divergent in the AET condition compared to the control condition. These results indicate that adaptive educational technologies combining extracted and embedded learning analytics are indeed creating new education scenarios that contribute to personalized learning in primary education.", "authors": ["Inge Molenaar", "Carolien Knoop van Campen"], "session": "POSTER SESSION: Posters"}, {"title": "Elaborating data intensive research methods through researcher-practitioner partnerships", "pages": "540-541", "doi": "10.1145/2883851.2883908", "abstract": "Technologies used by teachers and students generate vast amounts of data that can be analyzed to provide insights into improving teaching and learning. However, practitioners are left out of the process. We describe the development of an approach by which researchers and practitioners can work together to use data intensive research methods to launch improvement efforts within schools. This paper describes elements of the first year of a researcher-practitioner partnership, highlighting initial findings, challenges, and strategies for overcoming these challenges.", "authors": ["Mingyu Feng", "Andrew E. Krumm", "Alex J. Bowers", "Timothy Podkul"], "session": "POSTER SESSION: Posters"}, {"title": "Pipeline for expediting learning analytics and student support from data in social learning", "pages": "542-543", "doi": "10.1145/2883851.2883912", "abstract": "An important research problem in learning analytics is to expedite the cycle of data leading to the analysis of student progress and the improvement of student support. For this goal in the context of social learning, we propose a pipeline that includes data infrastructure, learning analytics, and intervention, along with computational models for individual components. Next, we describe an example of applying this pipeline to real data in a case study, whose goal is to investigate the positive effects that goal-setting students have on their peers, which suggests ways in which we might foster these social benefits through intervention.", "authors": ["Yohan Jo", "Gaurav Tomar", "Oliver Ferschke", "Carolyn Penstein Rosé", "Dragan Gašević"], "session": "POSTER SESSION: Posters"}, {"title": "The dutch xAPI experience", "pages": "544-545", "doi": "10.1145/2883851.2883968", "abstract": "We present the collected experiences since 2012 of the Dutch Special Interest Group (SIG) for Learning Analytics in the application of the xAPI standard. We have been experimenting and exchanging best practices around the application of xAPI in various contexts. The practices include different design patterns centered around Learning Record Stores. We present three projects that apply xAPI in very different ways and publish a consistent set of xAPI recipes.", "authors": ["Alan Berg", "Maren Scheffel", "Hendrik Drachsler", "Stefaan Ternier", "Marcus Specht"], "session": "POSTER SESSION: Posters"}, {"title": "Validity: a framework for cross-disciplinary collaboration in mining indicators of learning from MOOC forums", "pages": "546-547", "doi": "10.1145/2883851.2883956", "abstract": "Two research teams from the University of Melbourne's Learning Analytics Research Group used validation as applied in educational measurement to provide a framework for collaboration. One team was focussed on defining and building measures of learning capability of MOOCs participants, and the other on using topic modelling to discover topics in MOOC forums. The collaboration explored the suitability of items discovered from MOOC forums using topic modelling as measures of learning capability of participants in MOOCs.", "authors": ["Sandra Milligan", "Jiazhen He", "James Bailey", "Rui Zhang", "Benjamin I. P Rubinstein"], "session": "POSTER SESSION: Posters"}, {"title": "The connected learning analytics toolkit", "pages": "548-549", "doi": "10.1145/2883851.2883881", "abstract": "This demonstration introduces the Connected Learning Analytics (CLA) Toolkit. The CLA toolkit harvests data about student participation in specified learning activities across standard social media environments, and presents information about the nature and quality of the learning interactions.", "authors": ["Kirsty Kitto", "Aneesha Bakharia", "Mandy Lupton", "Dann Mallet", "John Banks", "Peter Bruza", "Abelardo Pardo", "Simon Buckingham Shum", "Shane Dawson", "Dragan Gašević", "George Siemens", "Grace Lynch"], "session": "DEMONSTRATION SESSION: Demos"}, {"title": "Wikiglass: a learning analytic tool for visualizing collaborative wikis of secondary school students", "pages": "550-551", "doi": "10.1145/2883851.2883966", "abstract": "This demo presents Wikiglass, a learning analytic tool for visualizing the statistics and timelines of collaborative Wikis built by secondary school students during their group project in inquiry-based learning. The tool adopts a modular structure for the flexibility of reuse with different data sources. The client side is built with the Model-View-Controller framework and the AngularJS library whereas the server side manages the database and data sources. The tool is currently used by secondary teachers in Hong Kong and is undergoing evaluation and improvement.", "authors": ["Xiao Hu", "Jason Ip", "Koossulraj Sadaful", "George Lui", "Sam Chu"], "session": "DEMONSTRATION SESSION: Demos"}, {"title": "Demonstration of the Unizin sentiment visualizer", "pages": "552-553", "doi": "10.1145/2883851.2883903", "abstract": "While much promise has been demonstrated in the learning analytics field with sentiment analysis, the analyses are typically post hoc. The Unizin Sentiment Visualizer demonstrates that the application of sentiment analysis in real-time provides a powerful new tool to support students in complex learning environments.", "authors": ["J. D. Freeman"], "session": "DEMONSTRATION SESSION: Demos"}]